In [2]:
import numpy as np
import pandas as pd

In [188]:
friend_dict_list = [{'이름': '나학생1', '중간고사점수': 95, '기말고사점수': 85},
         {'이름': '나학생2', '중간고사점수': 85, '기말고사점수': 80},
         {'이름': '나학생3', '중간고사점수': 10, '기말고사점수': 30}]
df = pd.DataFrame(friend_dict_list)
df

     이름  중간고사점수  기말고사점수
0  나학생1      95      85
1  나학생2      85      80
2  나학생3      10      30

In [189]:
df['총점'] = df['중간고사점수'] + df['기말고사점수']
df['평균점수'] = (df['총점']/2).astype(int)
df

     이름  중간고사점수  기말고사점수   총점  평균점수
0  나학생1      95      85  180    90
1  나학생2      85      80  165    82
2  나학생3      10      30   40    20

In [190]:
for i in df['평균점수'] :
    print(i)

90
82
20

In [191]:
for key, value in df.iterrows() :
    print(key,' ', value)

0   이름        나학생1
중간고사점수      95
기말고사점수      85
총점         180
평균점수        90
Name: 0, dtype: object
1   이름        나학생2
중간고사점수      85
기말고사점수      80
총점         165
평균점수        82
Name: 1, dtype: object
2   이름        나학생3
중간고사점수      10
기말고사점수      30
총점          40
평균점수        20
Name: 2, dtype: object

In [187]:
df['등급'] = None
index = 0
for i in df.평균점수 :
    if i >= 90 :
        df['등급'][index] = 'A'
    elif i > 80 :
        df['등급'][index] = 'B'
    else :
        df['등급'][index] = 'F'
    index = index + 1
df

C:\pyth\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """
C:\pyth\lib\site-packages\ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys
C:\pyth\lib\site-packages\ipykernel_launcher.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if __name__ == '__main__':

     이름  중간고사점수  기말고사점수   총점  평균점수 등급
0  나학생1      95      85  180    90  A
1  나학생2      85      80  165    82  B
2  나학생3      10      30   40    20  F

In [196]:
df['등급'] = df['평균점수'].apply(lambda x : 'A' if x >= 90 else 'B' if x >= 80 else 'F')
df

     이름  중간고사점수  기말고사점수   총점  평균점수 등급
0  나학생1      95      85  180    90  A
1  나학생2      85      80  165    82  B
2  나학생3      10      30   40    20  F

In [197]:
df['이수여부'] = df['등급'].apply(lambda x : 'Pass' if x != 'F' else 'Fail')
df

     이름  중간고사점수  기말고사점수   총점  평균점수 등급  이수여부
0  나학생1      95      85  180    90  A  Pass
1  나학생2      85      80  165    82  B  Pass
2  나학생3      10      30   40    20  F  Fail

In [202]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2018-12-20'}]
df = pd.DataFrame(date_list)
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2018-12-20

In [203]:
df['yyyy-mm-dd'] = df['yyyy-mm-dd'].apply(lambda x : x.split('-')[0])
df

  yyyy-mm-dd
0       2000
1       2002
2       2018

In [208]:
df['age'] = df['yyyy-mm-dd'].apply(lambda x : 2020 - int(x))
df

  yyyy-mm-dd  age
0       2000   20
1       2002   18
2       2018    2

In [209]:
student_list = [{'name': 'John', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Abraham', 'major': "Physics", 'gender': "male"},
                {'name': 'Brian', 'major': "Psychology", 'gender': "male"},
                {'name': 'Janny', 'major': "Economics", 'gender': "female"},
                {'name': 'Yuna', 'major': "Economics", 'gender': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'gender': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Zara', 'major': "Psychology", 'gender': "female"},
                {'name': 'Wendy', 'major': "Economics", 'gender': "female"},
                {'name': 'Sera', 'major': "Psychology", 'gender': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'gender'])
df

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [217]:
x = df.groupby('gender')
x.groups

{'female': Int64Index([4, 5, 6, 8, 9, 10], dtype='int64'),
 'male': Int64Index([0, 1, 2, 3, 7], dtype='int64')}

In [218]:
x.size()

gender
female    6
male      5
dtype: int64

In [219]:
y = df.groupby('major')
y.groups

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

In [223]:
for key, value in y:
    print(key, '-', len(value))

Computer Science - 4
Economics - 3
Physics - 1
Psychology - 3

In [224]:
y.size()

major
Computer Science    4
Economics           3
Physics             1
Psychology          3
dtype: int64

In [227]:
df2 = pd.DataFrame({'count' : y.size()}).reset_index()
df2

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [228]:
df3 = pd.DataFrame({'count' : x.size()}).reset_index()
df3

   gender  count
0  female      6
1    male      5